RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_adc.c
/*!
    \brief      get the ADC interrupt bits (API_ID(0x002FU))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EORC: end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
      \arg        ADC_INT_FLAG_IOVF: inserted data register overflow interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag)
{
    FlagStatus reval = RESET;
    uint32_t state;
    /* check the interrupt bits */
    switch(int_flag) {
    case ADC_INT_FLAG_WDE0:
        /* get the ADC analog watchdog 0 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE0;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE0IE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_EORC:
        /* get the ADC end of routine sequence conversion interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_EORC;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_EORCIE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_EOIC:
        /* get the ADC end of inserted sequence conversion interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_EOIC;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_EOICIE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_ROVF:
        /* get the ADC routine data register overflow interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_ROVF;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_ROVFIE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_WDE1:
        /* get the ADC analog watchdog 1 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE1;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE1IE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_WDE2:
        /* get the ADC analog watchdog 2 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE2;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE2IE) && state) {
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_IOVF:
        /* get the ADC inserted data register overflow interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_IOVF;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_IOVFIE) && state) {
            reval = SET;
        }
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief      clear the ADC flag (API_ID(0x0030U))
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EORC: end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
      \arg        ADC_INT_FLAG_IOVF: inserted data register overflow interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
    ADC_STAT(adc_periph) = ~((uint32_t)(int_flag & ADC_INT_FLAG_MASK));
}

/*!
    \brief      configure the ADC sync mode (API_ID(0x0031U))
    \param[in]  sync_mode: ADC sync mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_MODE_INDEPENDENT: all the ADCs work independently
      \arg        ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL: ADC0/1 work in combined routine parallel & inserted parallel mode, ADC2 works independently
      \arg        ADC_DUAL_ROUTINE_PARALLEL_INSERTED_ROTATION: ADC0/1 work in combined routine parallel & trigger rotation mode, ADC2 works independently
      \arg        ADC_DUAL_INSERTED_PARALLEL: ADC0/1 work in inserted parallel mode, ADC2 works independently
      \arg        ADC_DUAL_ROUTINE_PARALLEL: ADC0/1 work in routine parallel mode, ADC2 works independently
      \arg        ADC_DUAL_ROUTINE_FOLLOW_UP: ADC0/1 work in follow-up mode, ADC2 works independently
      \arg        ADC_DUAL_INSERTED_TRIGGER_ROTATION: ADC0/1 work in trigger rotation mode, ADC2 works independently
    \param[out] none
    \retval     none
*/
void adc_sync_mode_config(uint32_t sync_mode)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCM);
    ADC_SYNCCTL(ADC0) |= (uint32_t)(sync_mode & ADC_SYNCCTL_SYNCM);
}

/*!
    \brief      configure the delay between 2 sampling phases in ADC sync modes (API_ID(0x0032U))
    \param[in]  sample_delay:  the delay between 2 sampling phases in ADC sync modes
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DELAY_xCYCLE: x=5..20,the delay between 2 sampling phases in ADC sync modes is x ADC clock cycles
    \param[out] none
    \retval     none
*/
void adc_sync_delay_config(uint32_t sample_delay)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDLY);
    ADC_SYNCCTL(ADC0) |= (uint32_t)(sample_delay & ADC_SYNCCTL_SYNCDLY);
}

/*!
    \brief      configure ADC sync DMA mode selection (API_ID(0x0033U))
    \param[in]  dma_mode:  ADC sync DMA mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DMA_DISABLE: ADC sync DMA disabled
      \arg        ADC_SYNC_DMA_MODE0: ADC sync DMA mode 0
      \arg        ADC_SYNC_DMA_MODE1: ADC sync DMA mode 1
    \param[out] none
    \retval     none
*/
void adc_sync_dma_config(uint32_t dma_mode)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDMA);
    ADC_SYNCCTL(ADC0) |= (uint32_t)(dma_mode & ADC_SYNCCTL_SYNCDMA);
}

/*!
    \brief      configure ADC sync DMA engine issues requests according to the SYNCDMA bits (API_ID(0x0034U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_enable(void)
{
    ADC_SYNCCTL(ADC0) |= (uint32_t)ADC_SYNCCTL_SYNCDDM;
}

/*!
    \brief      configure ADC sync DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_disable(void)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDDM);
}

/*!
    \brief      read ADC sync master adc routine data register 0  (API_ID(0x0036U))
    \param[in]  none
    \param[out] none
    \retval     sync routine data 0
*/
uint32_t adc_sync_master_adc_routine_data0_read(void)
{
    return (uint32_t)(ADC_SYNCDATA0 & ADC_SYNCDATA0_SYNCDATA0);
}

/*!
    \brief      read ADC sync slave adc routine data register 0 (API_ID(0x0037U))
    \param[in]  none
    \param[out] none
    \retval     sync routine data 0
*/
uint32_t adc_sync_slave_adc_routine_data0_read(void)
{
    return (uint32_t)(ADC_SYNCDATA0 & ADC_SYNCDATA0_SYNCDATA1) >> 16;
}

/*!
    \brief      read ADC sync routine data register 1 (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     sync routine data 1
*/
uint32_t adc_sync_routine_data1_read(void)
{
    return (uint32_t)ADC_SYNCDATA1;
}
